# VertexPair Properties

---
The VertexPair type exposes the following members.
| Name| Description
---|---|---
| First|  Identifies the first index of VertexPair.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Second|  Identifies the second index of VertexPair.
Top
#### Reference
VertexPair Class
Autodesk.Revit.DB Namespace